posts/2020-12-11-emacs-journey/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My Emacs Journey 2020</title>
<meta name="generator" content="Org Mode" />
<meta name="author" content="Florian Winkelbauer">
<link rel="stylesheet" href="/site.css" type="text/css">
</head>
<body>
<div id="preamble" class="status">
<nav>
<a href="/">Home</a>
<a href="/notes">Notes</a>
<a href="/posts">Posts</a>
<a href="/projects">Projects</a>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">My Emacs Journey 2020</h1>
</header><p>
I guess I am not alone when I'll say that COVID-19 made this year go by in an
instant. It's time to write a small report on my Emacs usage.
</p>

<div id="outline-container-org9c34d69" class="outline-2">
<h2 id="org9c34d69">Org-Mode &amp; Magit</h2>
<div class="outline-text-2" id="text-org9c34d69">
<p>
Even if some fancy editor would make me consider to stop using Emacs, I'd still
use it just for org-mode and magit. Both tools are mentioned over and over on
the internet and I can understand why (even if it starts to become boring).
Those tools are just that good.
</p>

<p>
A few months ago I finally started to use org-capture to create entries in my
"inbox/notes" file without switching my current context. For some reason this
feature didn't appeal to me for a long time and I preferred to do things
manually. I still wouldn't consider myself a org power-user, so it might take
some more time to dive deeper into other more involved features.
</p>

<p>
Magit became even better after I had discovered <code>magit-file-dispatch</code>. Calling
this function while looking at a file gives you an option menu where you can
access functions such as listing all commits this file was changed in. It also
offers the possibility to step through different versions of the opened file.
</p>
</div>
</div>

<div id="outline-container-orgc98704c" class="outline-2">
<h2 id="orgc98704c">Hydra</h2>
<div class="outline-text-2" id="text-orgc98704c">
<p>
I started to use abo-abo's hydra package to create custom sets of keybindings,
which I have previously mentioned in my journey write-up last year. Here a few
examples of my current setup:
</p>

<ul class="org-ul">
<li><code>&lt;apps&gt;</code> or <code>&lt;menu&gt;</code> with <code>&lt;f5&gt;</code> as a fallback: Show a hydra with my most
common used commands such as "find file", "search in directory" or "switch
buffer"</li>
<li><code>&lt;f9&gt;</code>: Open a shell in the current directory</li>
<li><code>&lt;S-f9&gt;</code>: Show a hydra with "project" or "directory" related commands such as
"compile project" or "open this directory in a native file manager"</li>
<li><code>&lt;f10&gt;</code>: Open magit</li>
<li><code>&lt;S-f10&gt;</code>: Show a hydra with several magit related features (including
<code>magit-file-dispatch</code>)</li>
<li><code>&lt;f12&gt;</code>: Open my org agenda</li>
<li><code>&lt;S-f12&gt;</code>: Show a hydra which offers <code>org-capture</code>, <code>org-babel-tangle</code> and
many other org functions</li>
</ul>
</div>
</div>

<div id="outline-container-org4cf8928" class="outline-2">
<h2 id="org4cf8928">Custom Elisp</h2>
<div class="outline-text-2" id="text-org4cf8928">
<p>
I became proficient enough to write my own (very) simple elisp functions. Here
are few examples:
</p>

<ul class="org-ul">
<li>Open a shell for the current directory. If this directory is inside a git
repository, open a shell at the git "root" directory</li>
<li>Run a git pull operation for all my repositories in parallel</li>
<li>Copy the absolute or relative path of the currently opened file</li>
</ul>

<p>
Most of the time I'll start with a snippet I find on the internet, which I'll
adjust to my needs.
</p>
</div>
</div>

<div id="outline-container-org368b58b" class="outline-2">
<h2 id="org368b58b">Windows Performance</h2>
<div class="outline-text-2" id="text-org368b58b">
<p>
Sadly not much has changed regarding performance on Windows. Some operations
might take one or two seconds, which is inconvenient but not too bad. For the
most part I get irritated when I'm on a Linux machine as everything just happens
instantaneously.
</p>

<p>
I know that I could try running Emacs in WSL 2, but I couldn't bring myself to
go down that rabbit hole.
</p>
</div>
</div>

<div id="outline-container-orge88fc74" class="outline-2">
<h2 id="orge88fc74">.NET Development</h2>
<div class="outline-text-2" id="text-orge88fc74">
<p>
Chunkyard is a backup software that I develop as a hobby. As a form of personal
challenge I decided to write it in Emacs instead of Visual Studio or Visual
Studio Code. No code completion, no red error highlighting, no debugging. To
pull this off I started to use the <code>compile</code> and <code>recompile</code> functions which run
shell commands such as <code>dotnet build</code>. I wouldn't do this in a professional
setting, as I still believe that a dedicated IDE offers a better developer
experience.
</p>
</div>
</div>

<div id="outline-container-org678540c" class="outline-2">
<h2 id="org678540c">Next Steps</h2>
<div class="outline-text-2" id="text-org678540c">
<p>
Like last year I don't have any specific topics which I would like to focus on.
Most of the improvements of this year happened in tiny steps, which is how I'll
approach further improvements as well.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Published: 2020-12-11</p>
<footer>
<p>Copyright 2023, Florian Winkelbauer. All rights reserved.</p>
</footer>
</div>
</body>
</html>
